testSuite/incompressible/cavity3d/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel      Newtonian;

nu                  nu [0 2 -1 0 0 0 0] 1e-05;

// Legacy oodlesFOI entries
subgridModel        $__lesmodel;
ck                  ck [0 0 0 0 0 0 0] 0.07;
ce                  ce [0 0 0 0 0 0 0] 1.05;
wallFunction        $__wallmodel;
deltaApproximation  $__deltamodel;


// ************************************************************************* //
