testSuite/incompressible/cavity3d/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc     "etc/FOIincompressibleTurbulence"

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         $__endtime;

deltaT          0.0025;

writeControl    adjustableRunTime;

writeInterval   $endTime;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    forces
    {
        type                forces;
        functionObjectLibs  ("libforces.so");
        writeControl        timeStep;
        writeInterval       1;
        patches             (movingWall);
        pName               p;
        UName               U;
        rho                 rhoInf;
        log                 true;
        rhoInf              1;
        CofR                (0 0 0);
    }

}


// ************************************************************************* //
